using System;
using System.Runtime.InteropServices;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using System.Text;
using CrowdControl.Common;
using JetBrains.Annotations;
using CrowdControl.Games;

namespace CrowdControl.Games.Packs
{
    [UsedImplicitly]
    public class PokemonCrystal : GBEffectPack
    {
        [NotNull]
        private readonly IPlayer _player;

        public PokemonCrystal([NotNull] IPlayer player, [NotNull] Func<CrowdControlBlock, bool> responseHandler, [NotNull] Action<object> statusUpdateHandler) : base(player, responseHandler, statusUpdateHandler) => _player = player;

        private volatile bool _quitting = false;
        public override void Dispose()
        {
            _quitting = true;
            base.Dispose();
        }

        private static readonly Dictionary<string, (string name, byte id)> _Pokemon = new Dictionary<string, (string, byte)>
        {
            {"bulbasaur", ("Bulbasaur", 0x01)},
            {"ivysaur", ("Ivysaur", 0x02)},
            {"venusaur", ("Venusaur", 0x03)},
            {"charmander", ("Charmander", 0x04)},
            {"charmeleon", ("Charmeleon", 0x05)},
            {"charizard", ("Charizard", 0x06)},
            {"squirtle", ("Squirtle", 0x07)},
            {"wartortle", ("Wartortle", 0x08)},
            {"blastoise", ("Blastoise", 0x09)},
            {"caterpie", ("Caterpie", 0x0A)},
            {"metapod", ("Metapod", 0x0B)},

            return false;
        }

        private (bool check, ushort ret) GTrainerID() {
            return (ConnectorExtensions.Read16LE(this.Connector, (ulong)Address.ADDR_TRAINER_ID, out ushort ret), ret);
        }

        private static PokemonPartySlot GetSlotFromByte(byte b) {
            switch(b) {
                default:
                case 0x01:
                    return PokemonPartySlot.SLOT_1;
                case 0x02:
                    return PokemonPartySlot.SLOT_2;
                case 0x03:
                    return PokemonPartySlot.SLOT_3;
                case 0x04:
                    return PokemonPartySlot.SLOT_4;
                case 0x05:
                    return PokemonPartySlot.SLOT_5;
                case 0x06:
                    return PokemonPartySlot.SLOT_6;
            }
        }

        private static string UnmapPokeStringToString(byte[] unmapped) {
            char[] buff = new char[unmapped.Length];
            for(var i = 0; i < unmapped.Length; ++i) {
                var found = _PokeTextEncoding.First(t => t.Value == unmapped[i]);
                buff[i] = found.Key;
            }
            return new String(buff);
        }

        private static byte[] MapStringToPokeString(string mapped, uint len) {
            byte[] buff = new byte[len];
            for(var i = 0; i < mapped.Length; ++i) {
                var found = _PokeTextEncoding.Where(t => t.Key.Equals(mapped[i]));
                if (found.Any()) {
                    buff[i] = found.First().Value;
                }
            }

            for(var i = mapped.Length; i < len; ++i) buff[i] = 0x50;
            return buff;
        }

        private enum ProcessingType {

            GET,

            SET

        }

        private enum PokemonPartySlot: byte {

            SLOT_1 = 0x00,

            SLOT_2 = 0x01,

            SLOT_3 = 0x02,

            SLOT_4 = 0x03,

            SLOT_5 = 0x04,

            SLOT_6 = 0x05

        }

        public enum Address : ulong {

            ADDR_TRAINER_ID = 0x3196,

            ADDR_PARTY_SIZE = 0xDCD7,

            ADDR_PARTY_SPECIES = 0xDCD8,

            ADDR_PARTY_POKEMON = 0xDCDF,

            ADDR_PARTY_POKEMON_OT_NAME = 0xDDFF,

            ADDR_PARTY_POKEMON_NICKNAME = 0xDE41,

            ADDR_OT_NAME = 0xF47D,

            ADDR_NEXT_WILD_POKEMON = 0xD204,

            ADDR_DAY_OF_WEEK = 0xD4B6

        }

        public enum PocketType {

            ITEMS,

            KEY_ITEMS,

            POKE_BALLS,

            TM_AND_HM,

            UNKNOWN

        }

        public enum MoveSlot {

            MOVE_1,

            MOVE_2,

            MOVE_3,

            MOVE_4

        }

        //<summary>
        //Struct for Pokemon in party - 0x30 bytes long
        //</summary>
        [StructLayout(LayoutKind.Explicit, Size=0x30)]
        public struct PartyPokemon {

            [NotNull, FieldOffset(0x0000)] public byte species;//ID of pokemon

            [NotNull, FieldOffset(0x0001)] public byte heldItem;//Item held by pokemon

            [NotNull, FieldOffset(0x0002)] public byte move1;

            [NotNull, FieldOffset(0x0003)] public byte move2;

            [NotNull, FieldOffset(0x0004)] public byte move3;

            [NotNull, FieldOffset(0x0005)] public byte move4;

            [NotNull, FieldOffset(0x0006)] public ushort otId;//Original trainer id

            [NotNull, FieldOffset(0x0008)] public uint exp;//0x03 bytes long

            [NotNull, FieldOffset(0x000B)] public ushort hpStatExp;

            [NotNull, FieldOffset(0x000D)] public ushort atkStatExp;

            [NotNull, FieldOffset(0x000F)] public ushort defStatExp;

            [NotNull, FieldOffset(0x0011)] public ushort spdStatExp;

            [NotNull, FieldOffset(0x0013)] public ushort speStatExp;

            [NotNull, FieldOffset(0x0015)] public ushort dv;

            [NotNull, FieldOffset(0x0017)] public byte ppMove1;

            [NotNull, FieldOffset(0x0018)] public byte ppMove2;

            [NotNull, FieldOffset(0x0019)] public byte ppMove3;

            [NotNull, FieldOffset(0x001A)] public byte ppMove4;
            
            [NotNull, FieldOffset(0x001B)] public byte happiness;

            [NotNull, FieldOffset(0x001C)] public byte pokerusStatus;//??????

            [NotNull, FieldOffset(0x001D)] public ushort caughtData;//???????

            [NotNull, FieldOffset(0x001F)] public byte level;

            [NotNull, FieldOffset(0x0020)] public byte status;

            [NotNull, FieldOffset(0x0021)] public byte unused;

            [NotNull, FieldOffset(0x0022)] public ushort hp;

            [NotNull, FieldOffset(0x0024)] public ushort hpMax;

            [NotNull, FieldOffset(0x0026)] public ushort statAtk;

            [NotNull, FieldOffset(0x0028)] public ushort statDef;

            [NotNull, FieldOffset(0x002A)] public ushort statSpd;

            [NotNull, FieldOffset(0x002C)] public ushort statSpAtk;

            [NotNull, FieldOffset(0x002E)] public ushort statSpDef;

            public PartyPokemon(byte species, byte heldItem, byte move1, byte move2, byte move3, byte move4, ushort otId, uint exp, ushort hpStatExp, ushort atkStatExp, ushort defStatExp, ushort spdStatExp, ushort speStatExp, ushort dv, byte ppMove1, byte ppMove2, byte ppMove3, byte ppMove4, byte happiness, byte pokerusStatus, ushort caughtData, byte level, byte status, ushort hp, ushort hpMax, ushort statAtk, ushort statDef, ushort statSpd, ushort statSpAtk, ushort statSpDef) {
                this.species = species;
                this.heldItem = heldItem;
                this.move1 = move1;
                this.move2 = move2;
                this.move3 = move3;
                this.move4 = move4;
                this.otId = otId;
                this.exp = exp;
                this.hpStatExp = hpStatExp;
                this.atkStatExp = atkStatExp;
                this.defStatExp = defStatExp;
